# AnalyticalNodeData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalNodeData Class
Members See Also
---
This class holds information related to analytical model.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public class AnalyticalNodeData : IDisposable
```

Visual Basic
---
```text
Public Class AnalyticalNodeData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AnalyticalNodeData : IDisposable
```

# Remarks
This class is attached to a ReferencePoint.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..AnalyticalNodeData
# See Also
AnalyticalNodeData Members
Autodesk.Revit.DB.Structure Namespace